floatbody/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    (sixDoFRigidBodyMotion);

dynamicFvMesh       dynamicOversetFvMesh;

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (ov:cylinder);
    innerDistance   100.0;
    outerDistance   120.0;

    centreOfMass    (0 0 0);


    // Density of the solid
    rhoSolid        226.7;
    velocity        (0 0 0);

    // Cuboid mass
    mass            6;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (0.087 0.087 0.098);
    

    report          on;
    accelerationRelaxation 0.95;
    accelerationDamping    0.95;

    solver
    {
        type Newmark;
    }

    constraints
    {

       fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            centreOfRotation (0 0 0);
            direction (0 0 1);
        }

        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        } 
    }
}


// ************************************************************************* //
