floatbody/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bk:inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
    bk:outlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
    bk:stationarywalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bk:atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    bk:symmetry1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bk:symmetry2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    ov:cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
