floatbody/background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    bk:inlet
    {
         type            fixedValue;
        value           uniform (0 0 0);
    }
    
    bk:outlet
    {
         type            fixedValue;
        value           uniform (0 0 0);
    }
    
    bk:stationarywalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bk:atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bk:symmetry1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bk:symmetry2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ov:cylinder
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    ov:overset
    {
        patchType       overset;
        type            zeroGradient;
    }
}


// ************************************************************************* //
