floatbody/background/system/topoSetDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1 -0.5 -0.5) (1 0.5 0.5);
    }
    /*{
        name    c2;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-1.5 -1.5 -0.725) (1.5 1.5 5);
    }
    {
        name    c2;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-1.5 -1.5 7) (1.5 1.5 10.5);
    }*/
);


// ************************************************************************* //
